Documents/ЗаявлениеНаОтпуск.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявлениеНаОтпуск</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаОтпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияОтпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ИсторияСогласованийОтпусков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИсторияСогласованийОтпусков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеНаОтпуск</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЗаявлениеНаОтпуск/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		Объект.Сотрудник = ПараметрыСеанса.ТекущийПользователь;	
	КонецЕсли;
	
	ЗагрузитьИсториюСогласований();
	
КонецПроцедуры 

&НаСервере
Процедура ЗагрузитьИсториюСогласований() 
	
	ИсторияСогласований.Очистить();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсторияСогласованийОтпусков.Этап КАК Этап,
		|	ИсторияСогласованийОтпусков.Исполнитель КАК Исполнитель,
		|	ИсторияСогласованийОтпусков.Дата КАК Дата
		|ИЗ
		|	РегистрСведений.ИсторияСогласованийОтпусков КАК ИсторияСогласованийОтпусков
		|ГДЕ
		|	ИсторияСогласованийОтпусков.Документ = &Документ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	
	Запрос.УстановитьПараметр("Документ", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ИсторияСогласований.Добавить();
		
		НоваяСтрока.Этап			= Выборка.Этап;
		НоваяСтрока.Исполнитель		= Выборка.Исполнитель;
		НоваяСтрока.Дата  			= Выборка.Дата;
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ОбновитьИсториюНаСервере()
	ЗагрузитьИсториюСогласований();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИсторию(Команда)
	ОбновитьИсториюНаСервере();
КонецПроцедуры
